[
  {
    "articleid": "12",
    "artcategory": "2",
    "articletitle": "4 Marketing Trends from ExactTarget CEO Scott Dorsey",
    "articledescription": "1. Marketers have an unprecedented opportunity to lead deadershipandlearningareindispensibletooneanother. John F. Kennedy  It's a special time for marketing, says Dorsey, because marketers have the techonology and tools that connect to their customer. Youareclosesttothecustomer,saysDorsey. 2.Be a  customer company 88% of business leaders said being closer to their customers was the top priority for realizing their strategy over then extfive years - IBM Global CMO Study, 2013  A customer revolution is underway, says Dorsey. As a CEO himself, he shared that CEOs care about marketing more than ever before, because CEOs believe that getting closer to the customer is vital. This is a direct connection to becoming a customer company.  	3. It's all about cloud, social, and mobile 1.7billiontouch-screendevicesshippedin2012. - IDC  Dorsey shared that we are on the cusp of a world with five billion smartphones. He added that smartphones are now the dashboard for peoples' lives, serving as their camera, alarm clock, bank, schedule, news, map, communication tool, and much more. Dorsey even projected an image of his dashboard to the audience and challenged them to share their dashboards via Twitter using: #dashboardtoyourlife",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/salesround.png",
    "updatedtime": "2013-09-06 15:59:48",
	"authorname":"baburaj"
  },
  {
    "articleid": "13",
    "artcategory": null,
    "articletitle": "Data Quality: Your Secret Sales Superhero [FREE WEBINAR]",
    "articledescription": "Sales Team Kryptonite  In a study of Data.com customers (Nucleus Research: Value of Data Quality with Data.com), they found companies often adopted Data.com because they had three main challenges with traditional data sources and applications: Data Accuracy; Stale Data; Incomplete Data – don’t fall victim to underperforming data!  Improve Your Data Quality Superpowers  Increase pipeline growth Increase visibility Increase sales productivity Reduce Administration Overhead Sign up for the free webinar below to unlock your sales superhero.A channel partner distributes goods and services. There are three major types of channel partnership options to distribute your product.  1. You sell through your partner.  Product companies sell their product through a third party storefront. Retailers are partners to products they think will sell with their customers.This is the case with AppExchange on Salesforce, the AppStore for Apple or any marketplace. Another classic example is GILT Groupe, who partners with brands like Calvin Klein and Quicksilver, providing distribution by promoting products at discounts. This is a powerful strategy, acting as a source of potential customers as your partner grows. 2. Your partner sells with you.  Here, partners sell your products as an upsell or missing value proposition. Any company that offers your service as a way to expand their offering fits into this category.For example, a car reseller might work with a bank to upsell a car loan, or a software vendor might complement its offering with another partner.When Microsoft embeds an antivirus demo in its operating system, or when online services like Box bring in security providers to complement their enterprise offer, they are also employing this strategy. 3. Your partner sells for you.  Any partner acting as the promoter or seller of your product falls into this category. This partner is 1) a sales and marketing partner using marketing and sales resources to promote your product to new markets, or 2) a value added reseller, using your service as part of their own service offering. This provides additional value in the operation of that service, instead of simply selling it. This is the case in any distribution partnership, from your local supermarket, to more traditional distributors. This is also the case in an OEM partnership, like Dell selling computers with Intel processors inside.This scenario is the most complex because you have to make sure that your partner has an incentive to sell your product.",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/salescloud.png",
    "updatedtime": "2013-09-06 15:58:46",
	"authorname":"arun"
  },
  {
    "articleid": "10",
    "artcategory": "2",
    "articletitle": "30 Inspirational Content Marketing Quotes from Experts",
    "articledescription": "Nearly a third of consumers believe that businesses are now paying less attention to providing good customer service. On top of that, just seven-percent of those polled say that customer service experiences they have with companies typically exceed their expectations. Now think about how you could succeed and profit as a business if you not only continually offered good service to your customers, but also frequently offered more than what they expected.  One of the best ways to get started is to line up your customer service with your brand. In fact, good service has been found time and time again to trump advertising when it comes to impact on brand image. But first you must put these five key building blocks in place.  1. Have a clear brand promise.  A November 2012 study by the American Society of Quality, found that among the 600 companies examined, the single largest challenge was the setting of proper expectations. Take the time to clearly state what your brand is about. This includes what you are and aren’t willing to do when it comes to customer service, so there is no confusion.  2. Require everyone to follow the brand promise.  Employees from top to bottom must walk the talk of the brand promise. Managers are responsible for enforcing this, but more importantly, of leading by example. You can’t expect a cashier to follow certain customer service protocols, if their boss isn’t willing to jump in and do the same.  3. Figure out what your values are.  Small businesses need not create a grand mission statement like a larger organization might. But they can still put into a few words what their vision is. Ask what the value add of your service or product might be. Then write it down. You may choose words like “efficiency,”“knowledgeable,”“genuine,”“innovative,” or even, “real.”  4. Formalize your customer service process, but allow for flexibility.  Once your vision is in place, take the time to map out your customer service plan. Train your employees that there is one way of doing things, but also let them know that there will be situations where they can let go of the “process”. Teach them to be consistent, but not have to a robotic response.  5. Measure your customer service and ask for feedback.  Find a way to track your customer service to ensure it backs your brand image. One tried and true method is to ask for feedback. Most people won’t tell you what you did wrong if there is not a safe way to complain. This especially applies to small businesses, because customers are more likely to know you personally.",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/sales.png",
    "updatedtime": "2013-09-06 15:57:35",
	"authorname":"Rajesh"
  },
  {
    "articleid": "9",
    "artcategory": null,
    "articletitle": "The Dynamic Duo: Marketing Automation and CRM Platforms [INFOGRAPHIC]",
    "articledescription": "Technology has presented sales reps with a whole host of new opportunities, but also created a new level of complexity in the sales cycle and everyday responsibilities of sales reps.To tackle these complex challenges, companies are leaning more and more on powerful tools like CRM platforms and marketing automation to simplify their workflows and make their teams more effective. While CRMs and marketing automation have a lot to offer on their own, integrating the two systems can provide your organization with a supercharged suite of tools that can give sales and marketing teams a dramatic edge over the competition.Check out the infographic below to see exactly what integrating these two tools can do for your team and grab your copy of our newest white paper, Marketing Automation and Your CRM: The Dynamic Duo, to dive in even deeper.companies are leaning more and more on powerful tools like CRM platforms and marketing automation to simplify their workflows and make their teams more effective. While CRMs and marketing automation have a lot to offer on their own, integrating the two systems can provide your organization with a supercharged suite of tools that can give sales and marketing teams a dramatic edge over the competition.companies are leaning more and more on powerful tools like CRM platforms and marketing automation to simplify their workflows and make their teams more effective. While CRMs and marketing automation have a lot to offer on their own, integrating the two systems can provide your organization with a supercharged suite of tools that can give sales and marketing teams a dramatic edge over the competition.",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/salesfoceone.png",
    "updatedtime": "2013-09-06 15:56:46",
	"authorname":"Sailppa"
  },
  {
    "articleid": "8",
    "artcategory": "3",
    "articletitle": "10 Things You Can Do to Become a Rock Star Sales Manager",
    "articledescription": "Here’s a list of ten things you can do to become a rock star sales manager. Following this recipe will help you lead your team to their best ever results, and it will help you turn in your best ever performance, too.  1.  Care about your salespeople.  Sales management is a leadership role. You aren’t managing a team as much as you are leading that team (I’ll have more to say about this later). If you want your team to care deeply about succeeding, about making their number, about creating value for your clients, then you start by caring about your salespeople. Show them you care about them individually.  2.  Learn to coach.  The relationship you have with your salespeople should be a good coaching relationship. Since we’ve already established that you are going care deeply about their well being, you will already have the platform of trust that allows you to help your salespeople see their own blind spots. Good coaching is a careful balance of being non-directive and helping the salesperson learn some things on their own and being directive and telling them what you need them to do. Learn to coach the individuals on your team.  3.  Provide continuous training.  You may have thought that you took care of the need for continuous training by hiring salespeople with experience. You didn’t. All salespeople benefit from acquiring new ideas, new skills, and a further grounding in fundamental principles of good selling. Don’t ever stop providing training.  4.  Serve your salespeople before your company.  The main challenge for a sales manager is finding the time to invest in their team. Your organization is going to make serious demands of you. And what your company wants from you is important. They want reports, information, more reports, your attendance at meetings, and even more reports. At the end of the day (or quarter), you are going to be measured by how well your team does. Serve your team first. Invest your time and energy there. Be efficient in providing your company what it needs, but know it won’t make the number go up. Put your team’s needs first.  5.  Be the example.  If you want your sales team to create value for clients, let them see you create value. If you want your team to persevere, let them see you persevere. If you want your team to develop themselves as professionals, let them see you developing yourself. They are going to be what you are. Be the example.  6.  Don’t be the super-closer.  You may have found yourself in a sales management role because you did well in sales. Maybe you even closed some really big deals. You will not succeed in sales management by being the super-closer. You are already spread to thin, and your quota (read: the combined quota of each of your team members) is too large for you to make by trying to close their deals. You may need to help with some “must win” deals, but you aren’t the super-closer.  7.  Create independents.  Your job as a sales manager is to create “independents.” If your sales team has to come to you for every answer, you aren’t going to succeed. Your role as a leader is to create people who can succeed in doing their job well without your help. This doesn’t mean that you won’t help them. Instead, it means you help them gain the competency to make good decisions on their own. The last thing you want or need is dependents. It will make you feel needed, but it will ruin your results. Make them independent.  8.  Focus as much on effectiveness as activity.  It’s easy to believe that more activity will automatically equal better results. That’s because there are so many salespeople for whom this is true. But more poor activity isn’t the right answer. When you look at low activity, recognize that part of the reason it is low is likely that the salesperson isn’t effective and lacks confidence. Focus on fixing the effectiveness problem first. People like doing things they do well. Good sales management is a careful balance of activity and effectiveness.  9.  Provide air cover.  Your sales organization is going to do things that make it tough for your team to succeed. They have good intentions, but don’t always recognize the effects of their decisions. You have to stand up to the organization and protect your team when necessary. But, once a decision is made, you never complain down. You support the decision and you march. Give air cover when necessary.  10.  Remember your lessons.  If you’ve gotten this far, it’s important to remember what you learned from your best sales manager. What did she do that helped you succeed and grow beyond anything you imagined? What made her special? It’s also helpful to recall what you learned from your worst sales manager. What did you tell yourself that you would never do if you were a sales manager? Now is your chance to apply those lessons! Use these ten ideas as a list of prompts. Review each item and make an action plan around each one of them. Then put them into practice as fast is humanly possible; your team’s success depends upon it.",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/salesfoce.png",
    "updatedtime": "2013-09-06 15:55:38",
	"authorname":"Sathiskumar"
  },
  {
    "articleid": "7",
    "artcategory": "2",
    "articletitle": "3 Unexpected Benefits Service Cloud Brought to FICO",
    "articledescription": "FICO had outgrown their customer service support system. The company, which protects billions of credit and debit cards from fraud, and whose products are used by 90-percent of the U.S. financial market, needed a solution that would take their call tracking to the next level.As a longtime salesforce.com customer, FICO chose Service Cloud as the right tool to fix a number of problems, including poor business visibility into metrics, low portal adoption, and a four-to-seven month lead time for changes. Using Service Cloud, FICO has quickly turned things around, gaining a real-time 360-degree view of sales and service, quicker decision making due to dashboards, and increased agent productivity as a result of email integration. In addition, they have enjoyed three unexpected benefits, detailed below by FICO Sr. Director of Product Services, Steve Wickens. 1. Healthy Competition  As a global company, FICO employs small customer service teams all over the world. A big win for them once Service Cloud was added is how these teams, on their own, adopted a form of gamification. Multiple queues can be viewed at once, so there is a healthy competition to see who can keep their queue empty. If customer service requests take longer to resolve, other teams can see that delay, and eyebrows are raised, so to speak.  2. Lowered Expenses  Customer case volume is up 10-percent this year for FICO, and yet year-over-year, organizational expenses have gone down. Thanks to Service Cloud, FICO is able to resolve cases much more quickly, meaning the increase in work can be absorbed using existing resources.   3. Record CSAT  Since adding Service Cloud, overall resolution time for FICO has decreased by 22-percent. The company is also on-target to achieve the highest customer satisfaction (CSAT) rating in its history, upwards of 93-percent. FICO has plans to continue this excellence by targeting service issues with training opportunities, which should improve customer experience, bring higher satisfaction for clients, and reduce service calls.",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/salesdemand.png",
    "updatedtime": "2013-09-06 15:54:14",
	"authorname":"Loganathan"
  },
  {
    "articleid": "6",
    "artcategory": null,
    "articletitle": "What is This App Thing Anyway?",
    "articledescription": "Did you answer, “an application?” I beg to differ.  Don’t worry – you’re not alone. Suddenly everything is an “app.” Bloated office productivity software? An app. Gigantic social networking site for pets? An app.  This app-washing misses the importance of this new paradigm. If you are app-washing your product, you are falling behind.  So What is an App?  An “app” is a bit of code which delivers a set of context specific capabilities to a target audience. Apps offer a focused approach and execute in a runtime environment very close to the user.  Apple design award-winner, Paper, is an app because it gives people with iPads who like to doodle a way to do that without buying and toting around a bunch of Moleskine notebooks.  Acquisition darling, Instagram, is an app because it gives people with cameras on their phones an easy way to make their pictures look better and share them with friends. The Bank of America app works because it gives their customers with mobile devices access to account information and the ability to manipulate their financial life on the go.But are Apps Really Different? You bet they are — in a very fundamental way. Think back, if you will, to your first experience working with a computer. Chances are you physically went to the computer. Applications were located on the computer. It was an intentional action, a destination. There was a fundamental scarcity when it came to technology, and it shaped everything about the tools.Apps fundamentally flip this relationship. Apps come to the user and are available when the user wants them. The technological tools required to run these context-sensitive bits of code are cheap and easy, and the code itself is similarly inexpensive.This flip has driven other interesting changes, too. The biggest is the creation of a whole new specialization: the user experience professional. In a world where technology is cheap and available, the way a user interacts with software is suddenly more important than what software can do.Incredible! The app paradigm is here to stay, and we in the industry are just starting to get the hang of it. The next twenty years will see tremendous innovation in this space. Developers, my advice to you is simple: jump in. You probably have a device (or three) that can run apps, so take some time to write a simple one. Make it a browser plugin, an iOS app or play around with Node.js. Download a template or follow a guide to get started.",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/salescloud.png",
    "updatedtime": "2013-09-06 15:50:29",
	"authorname":"Kiruthiga"
  },
  {
    "articleid": "5",
    "artcategory": "2",
    "articletitle": "Socializing the Back Office: Creating a True Customer-Centric Enterprise",
    "articledescription": "More and more companies now actively use social and mobile to improve collaboration. Sales and Marketing teams receive a lot of the headlines when it comes to connected apps and devices. But to build a truly customer-centric organization, back-office functions, namely Finance, Services and HR, must also be connected in real-time to the rest of the organization. Because soon, enabling cross-departmental, cross-geographic collaboration will no longer an option. As analyst Phil Wainewright has said, businesses must connect to compete.The Rise of the Connected Enterprise Many have tried to define what a connected enterprise is by talking solely about technology. That’s upside down. A truly connected organization – optimized by mobile and social capabilities – sees itself as a customer-focused enterprise. It operates around the customer, whether it’s interactions through social networks or behind the scenes in managing customer transactions. It is committed to maintaining a comprehensive view of its customers, for the purpose of best serving them, which in turn serves the bottom line. Once your organization has this view, it’s clear why connected apps need to part of your corporate strategy. Connected apps are particularly adept at knocking down barriers between people and departments, and the back-office has the potential to be the biggest beneficiary from the move towards this new level of connection – shifting its role from command-and-control, to an active participant and enabler in critical business conversations. Groups from other sides of the wall like sales and finance can better collaborate on issues that matter not only to them but to the business as a whole. And management can have a better understanding on the pulse of the business by listening to the cross-channel chatter between departments. Teams can get off of the reply-all, black hole of email and participate in real-time group discussions no matter where they are, and more importantly, inside back-office apps within the context of the customer activity or the transaction that generated the conversation in the first place. But back-office functions have been the laggards in adopting connected apps, particularly mobile. According to one survey, most accountants think of “social” as a distraction or a serious security threat. In another, finance ranked second to last for use of social media among all corporate job functions. It's Not Just the Bookkeepers A report from McKinsey Global Institute points out that while almost any human interaction in the workplace can be socialized, only five percent of all communications and content use in the U.S. happens on social networks.  That’s simply not good enough.  Especially since that same McKinsey report shows that connected technologies stand to unlock from $900 billion to $1.3 trillion in value. According to the report, all that upside comes from improved communications and collaboration within and across enterprises. Far from a distraction, connected technologies represent one of the greatest opportunities to boost productivity in the enterprise. And to make the back-office an effective participant, the organizations, across every department, need to redefine customer experience as customer interactions at every touch point, from support, marketing, sales, to billing and collections.  The good news is that there are a growing number of mobile and social-embedded back-office applications that offer a seamless gateway for those in Accounting, Billing, Services and Support. These systems incorporate the financial and back-office aspect of the customer relationship into the domain of the front-office and visa versa. They offer a way for departments to leapfrog to more central and strategic roles where their customer insight plays an integral role in creating a true 360 view of customers for the entire organization.  The bottom line is understanding and commitment. Understanding the why behind building a customer-centric enterprise is first. Committing to connecting Sales, Support and Finance to create a synchronized view of customer activity, billing and product usage is a next step. Buying shiny iPads for employees? Without thinking through the first two, you’re likely to do no better than improve corporate Angry Birds scores.",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/sales.png",
    "updatedtime": "2013-09-06 15:49:09",
	"authorname":"Justin"
  },
  {
    "articleid": "20",
    "artcategory": "21",
    "articletitle": "The Number 1 Way to Close Twice as Many Deals",
    "articledescription": "Many sales and marketing organizations today have created ROI calculators to help prospects quantify the value of their product or service. And while the concept of an ROI calculator is sound, most get sparingly used by sales professionals in the field, and even then they don’t have nearly the impact you expected. Why is this? I believe it often boils down to one or more of six reasons:  1. It’s too complicated  In an effort to make the calculator’s results as accurate as possible, most companies make the inputs and calculations far too complicated. If the prospect can’t follow your thinking, or understand the intricacies of your math, they’ll likely give up and not understand or believe what you’re trying to communicate.  2. It’s not believable  A good ROI calculator often is more of a ballpark estimate than something truly precise, but the assumptions behind the calculations still must be rooted in reality. If the prospect doesn’t believe stated results can be achieved, then you likely haven’t done enough up-front work to establish that change is in fact possible beyond what they could previously comprehend. Oftentimes, in this case, it’s actually better to build a calculation that’s less than what you think you can actually achieve. Get the prospect thinking in your direction, then under-promise and over-deliver.  3. It doesn’t tell a story  Good sales is often based on great storytelling. Help your prospect understand where you’re taking them, and how that relates to the bigger picture of the business objectives they’re trying to achieve with or without you. Your ROI calculator, therefore, can’t simply quantify something in isolation from the rest of the prospect’s business. It must tell a story that aligns with the customer’s priorities, and helps them tell a story they’re already trying to piece together.  4. It’s hard to read  This is about formatting. Most ROI calculators are built in Microsoft Excel or other spreadsheet tools, which can be fairly wonky if not formatted well. Some of the more effective uses of spreadsheets for ROI calculators have a “summary” tab up front that’s nicely formatted and isolates the “money” metrics. Or even better, work with a company such as Visualize ROI to turbo-charge how effectively your ROI metrics are presented.  5. It doesn’t take the buyer’s point of view  I can’t tell you how many ROI calculators I’ve seen that focus on product usage, seller-specific metrics or language that doesn’t mean anything to the buyer. Carlos Hidalgo‘s mantra of late needs to be running through your brain when building an ROI calculator as well – it’s all about the buyer’s perspective.  6. It doesn’t matter  What if you built an ROI calculator that accurately and persuasively communicated something that wasn’t important to the prospect? That wasn’t something they were focused on or cared about? It happens more often than you think. Just as your product or service needs to solve an urgent problem or need, your ROI calculator needs to focus on that same “compelling event” as well.",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/customer.png",
    "updatedtime": "2013-08-30 10:52:50",
	"authorname":"ArunKumar"
	
  },
  {
    "articleid": "22",
    "artcategory": "23",
    "articletitle": "Sales Pros: What Do Your Customers Do?",
    "articledescription": "As sales professionals, we’re supposed to really understand our customers, their markets, industries, businesses, functions, and their jobs. It’s critical in engaging them in discussions about the things they care about. It’s critical to be able to relate to them on their terms so we are credible and can build a trusted relationship. It’s easy to say that.  If we’re lucky, marketing has provided us content and tools to help us better understand. We may have training on the industries and markets. We may have various “personas” that help us understand the roles of the people we call on.   But who IS your customer?  In reality, we struggle to relate. We can read about CFOs, if those are our target customers. We can get a lot of data about them, down to the LinkedIn profile. But unless we’ve been a CFO, it’s really difficult to understand them, know what they worry about, how they think, how best to engage and connect with them.  So how do we fix this? Without actually doing the job, how do we better understand what our customers do?  It’s actually not that hard. Virtually every company has people doing similar jobs to those our customers do. Or we have friends who do the jobs our customers do.  Your company has a CFO. If you make products, you have a VP of Engineering/Development, a VP of Manufacturing, and so forth. They face similar challenges to those our customers face. They get salespeople calling them every day, they have opinions, and they know what they want to hear.  So if we really want to find out what our customers do, find that person within your company.  Start asking questions and start learning  Ask the questions you always wanted to ask a customer.   What does your typical day look like? How do you find yourself spending your time? How are you  measured? How does that impact what you do? How do you set priorities for your function? How do you manage your team? What kinds of reports do you look at to know whether your team is doing what they should?  Would you mind walking through one with me? What kinds of things do you talk about in your staff meetings? Do you mind if I sit in on one sometime? What are the biggest difficulties you face in doing your job? What are the biggest issues you and people in your function face? What are your dreams? What are your goals? What keeps you awake at night? What do you read to keep updated with things going on in your function and industry? Which blogs, which magazines? How do you keep informed and up-to-date? What’s your reaction to salespeople who are trying to meet with you? How do you decide which salespeople you will meet with, which you will push to someone else, and who you will ignore? What do you like to see a sales person talk about in meetings with you? What do you see sales people doing really badly when they meet with you? What did the best salesperson you ever worked with do to earn your respect? What about gate keepers? (You may also want to talk to that person’s assistant and ask them similar questions.) How do you like to be sold to? How do you buy? When you decide to buy something, how do you really get approval, how do you really get things done? How knowledgeable about your function do you expect salespeople to be?",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/sales.png",
    "updatedtime": "2012-08-30 10:52:35",
	"authorname":"Kodish"
  },
  {
    "articleid": "25",
    "artcategory": "26",
    "articletitle": "Sync, Share and Make Files Social with Salesforce",
    "articledescription": "Many people believe that mobile apps are mainly for consumers. Applications such as Google Maps, iTunes, Foursquare and a number of others are used millions of times a day.  But what a lot of people don't know is that mobile applications for business are gaining ground as more and more field representatives and work-at-home employees are taking advantage of innovation in the enterprise space.   Yes, most enterprise workers—especially in regulated industries—still travel to an office, fire up a laptop or desktop, and go to work. That will continue for a long time to come. Also, some companies simply do not want to allow employees to work from home unless they absolutely must. Those are corporate choices undoubtedly made for good reasons.   But cloud IT, led by service providers such as salesforce.com and others, is filling gaps, saving time and dollars, and offering a great deal of convenience for many companies.  Here is a list of some of Salesforce's top 10 hottest enterprise mobile apps of 2013. 1. Apttus Apttus’ quoting solution allows you to rapidly configure price and quote any product or service.  Apttus category-defining software drives the quote-to-cash process, increasing revenue and maximizing visibility and control. 2. DocuSign DocuSign is a fast, secure way to sign, send and store documents in the cloud. Whether you need to close a sales contract, buy a home or approve a project estimate, DocuSign's eSignature can handle it. You can sign at any time, any place on any Internet-enabled device. 3. Concur Concur is a leading global provider of integrated online and mobile business travel and expense management applications. 4. ServiceMax ServiceMax is field-service management software that the company positions as powerful, easy-to-use, efficient, mobile and collaborative. 5. Bracket Labs Bracket Labs was founded in 2010 to build applications distributed through the Salesforce.com AppExchange. The company's top apps are TaskRay, a shared to-do list and Campaign Calendar, which is a shared calendar for marketing campaigns. The company focuses its app designs on simplicity, agility and customer satisfaction. 6. Sylpheo Sylpheo enables sales people to make more calls. The Sylpheo apps are designed to enable faster, easier calling and contact management from any location. 7. Taptera Taptera transforms the unstoppable bring your own device, or BYOD, movement from an IT integration and security headache into a competitive advantage for businesses. These apps also represent transformational technology in fields such as CRM and conferences and events. 8. Xactly The core purpose of Xactly is to empower companies of all sizes to incent their employees correctly and scientifically. Xactly enables companies to design, implement, manage, audit and communicate sales compensation programs. ",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/salescloud.png",
    "updatedtime": "2013-08-30 10:52:35",
	"authorname":"Rajesh"
  },
  
  {
    "articleid": "27",
    "artcategory": "28",
    "articletitle": "Socializing the Back Office: Creating a True Customer-Centric Enterprise",
    "articledescription": "More and more companies now actively use social and mobile to improve collaboration. Sales and Marketing teams receive a lot of the headlines when it comes to connected apps and devices. But to build a truly customer-centric organization, back-office functions, namely Finance, Services and HR, must also be connected in real-time to the rest of the organization. Because soon, enabling cross-departmental, cross-geographic collaboration will no longer an option. As analyst Phil Wainewright has said, businesses must connect to compete.The Rise of the Connected Enterprise Many have tried to define what a connected enterprise is by talking solely about technology. That’s upside down. A truly connected organization – optimized by mobile and social capabilities – sees itself as a customer-focused enterprise. It operates around the customer, whether it’s interactions through social networks or behind the scenes in managing customer transactions. It is committed to maintaining a comprehensive view of its customers, for the purpose of best serving them, which in turn serves the bottom line. Once your organization has this view, it’s clear why connected apps need to part of your corporate strategy. Connected apps are particularly adept at knocking down barriers between people and departments, and the back-office has the potential to be the biggest beneficiary from the move towards this new level of connection – shifting its role from command-and-control, to an active participant and enabler in critical business conversations. Groups from other sides of the wall like sales and finance can better collaborate on issues that matter not only to them but to the business as a whole. And management can have a better understanding on the pulse of the business by listening to the cross-channel chatter between departments. Teams can get off of the reply-all, black hole of email and participate in real-time group discussions no matter where they are, and more importantly, inside back-office apps within the context of the customer activity or the transaction that generated the conversation in the first place. But back-office functions have been the laggards in adopting connected apps, particularly mobile. According to one survey, most accountants think of “social” as a distraction or a serious security threat. In another, finance ranked second to last for use of social media among all corporate job functions. It's Not Just the Bookkeepers A report from McKinsey Global Institute points out that while almost any human interaction in the workplace can be socialized, only five percent of all communications and content use in the U.S. happens on social networks.  That’s simply not good enough.  Especially since that same McKinsey report shows that connected technologies stand to unlock from $900 billion to $1.3 trillion in value. According to the report, all that upside comes from improved communications and collaboration within and across enterprises. Far from a distraction, connected technologies represent one of the greatest opportunities to boost productivity in the enterprise. And to make the back-office an effective participant, the organizations, across every department, need to redefine customer experience as customer interactions at every touch point, from support, marketing, sales, to billing and collections.  The good news is that there are a growing number of mobile and social-embedded back-office applications that offer a seamless gateway for those in Accounting, Billing, Services and Support. These systems incorporate the financial and back-office aspect of the customer relationship into the domain of the front-office and visa versa. They offer a way for departments to leapfrog to more central and strategic roles where their customer insight plays an integral role in creating a true 360 view of customers for the entire organization.  The bottom line is understanding and commitment. Understanding the why behind building a customer-centric enterprise is first. Committing to connecting Sales, Support and Finance to create a synchronized view of customer activity, billing and product usage is a next step. Buying shiny iPads for employees? Without thinking through the first two, you’re likely to do no better than improve corporate Angry Birds scores.",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/sales.png",
    "updatedtime": "2013-09-06 15:49:09",
	"authorname":"Shankar"
  },
  {
    "articleid": "29",
    "artcategory": "30",
    "articletitle": "The Number 1 Way to Close Twice as Many Deals",
    "articledescription": "Many sales and marketing organizations today have created ROI calculators to help prospects quantify the value of their product or service. And while the concept of an ROI calculator is sound, most get sparingly used by sales professionals in the field, and even then they don’t have nearly the impact you expected. Why is this? I believe it often boils down to one or more of six reasons:  1. It’s too complicated  In an effort to make the calculator’s results as accurate as possible, most companies make the inputs and calculations far too complicated. If the prospect can’t follow your thinking, or understand the intricacies of your math, they’ll likely give up and not understand or believe what you’re trying to communicate.  2. It’s not believable  A good ROI calculator often is more of a ballpark estimate than something truly precise, but the assumptions behind the calculations still must be rooted in reality. If the prospect doesn’t believe stated results can be achieved, then you likely haven’t done enough up-front work to establish that change is in fact possible beyond what they could previously comprehend. Oftentimes, in this case, it’s actually better to build a calculation that’s less than what you think you can actually achieve. Get the prospect thinking in your direction, then under-promise and over-deliver.  3. It doesn’t tell a story  Good sales is often based on great storytelling. Help your prospect understand where you’re taking them, and how that relates to the bigger picture of the business objectives they’re trying to achieve with or without you. Your ROI calculator, therefore, can’t simply quantify something in isolation from the rest of the prospect’s business. It must tell a story that aligns with the customer’s priorities, and helps them tell a story they’re already trying to piece together.  4. It’s hard to read  This is about formatting. Most ROI calculators are built in Microsoft Excel or other spreadsheet tools, which can be fairly wonky if not formatted well. Some of the more effective uses of spreadsheets for ROI calculators have a “summary” tab up front that’s nicely formatted and isolates the “money” metrics. Or even better, work with a company such as Visualize ROI to turbo-charge how effectively your ROI metrics are presented.  5. It doesn’t take the buyer’s point of view  I can’t tell you how many ROI calculators I’ve seen that focus on product usage, seller-specific metrics or language that doesn’t mean anything to the buyer. Carlos Hidalgo‘s mantra of late needs to be running through your brain when building an ROI calculator as well – it’s all about the buyer’s perspective.  6. It doesn’t matter  What if you built an ROI calculator that accurately and persuasively communicated something that wasn’t important to the prospect? That wasn’t something they were focused on or cared about? It happens more often than you think. Just as your product or service needs to solve an urgent problem or need, your ROI calculator needs to focus on that same “compelling event” as well.",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/customer.png",
    "updatedtime": "2013-08-30 10:52:50",
	"authorname":"Sikkanthar"
  },
  {
    "articleid": "31",
    "artcategory": "32",
    "articletitle": "Sales Pros: What Do Your Customers Do?",
    "articledescription": "As sales professionals, we’re supposed to really understand our customers, their markets, industries, businesses, functions, and their jobs. It’s critical in engaging them in discussions about the things they care about. It’s critical to be able to relate to them on their terms so we are credible and can build a trusted relationship. It’s easy to say that.  If we’re lucky, marketing has provided us content and tools to help us better understand. We may have training on the industries and markets. We may have various “personas” that help us understand the roles of the people we call on.   But who IS your customer?  In reality, we struggle to relate. We can read about CFOs, if those are our target customers. We can get a lot of data about them, down to the LinkedIn profile. But unless we’ve been a CFO, it’s really difficult to understand them, know what they worry about, how they think, how best to engage and connect with them.  So how do we fix this? Without actually doing the job, how do we better understand what our customers do?  It’s actually not that hard. Virtually every company has people doing similar jobs to those our customers do. Or we have friends who do the jobs our customers do.  Your company has a CFO. If you make products, you have a VP of Engineering/Development, a VP of Manufacturing, and so forth. They face similar challenges to those our customers face. They get salespeople calling them every day, they have opinions, and they know what they want to hear.  So if we really want to find out what our customers do, find that person within your company.  Start asking questions and start learning  Ask the questions you always wanted to ask a customer.   What does your typical day look like? How do you find yourself spending your time? How are you  measured? How does that impact what you do? How do you set priorities for your function? How do you manage your team? What kinds of reports do you look at to know whether your team is doing what they should?  Would you mind walking through one with me? What kinds of things do you talk about in your staff meetings? Do you mind if I sit in on one sometime? What are the biggest difficulties you face in doing your job? What are the biggest issues you and people in your function face? What are your dreams? What are your goals? What keeps you awake at night? What do you read to keep updated with things going on in your function and industry? Which blogs, which magazines? How do you keep informed and up-to-date? What’s your reaction to salespeople who are trying to meet with you? How do you decide which salespeople you will meet with, which you will push to someone else, and who you will ignore? What do you like to see a sales person talk about in meetings with you? What do you see sales people doing really badly when they meet with you? What did the best salesperson you ever worked with do to earn your respect? What about gate keepers? (You may also want to talk to that person’s assistant and ask them similar questions.) How do you like to be sold to? How do you buy? When you decide to buy something, how do you really get approval, how do you really get things done? How knowledgeable about your function do you expect salespeople to be?",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/sales.png",
    "updatedtime": "2012-08-30 10:52:35",
	"authorname":"Bhooto"
  },
  {
    "articleid": "35",
    "artcategory": "45",
    "articletitle": "Sync, Share and Make Files Social with Salesforce",
    "articledescription": "Many people believe that mobile apps are mainly for consumers. Applications such as Google Maps, iTunes, Foursquare and a number of others are used millions of times a day.  But what a lot of people don't know is that mobile applications for business are gaining ground as more and more field representatives and work-at-home employees are taking advantage of innovation in the enterprise space.   Yes, most enterprise workers—especially in regulated industries—still travel to an office, fire up a laptop or desktop, and go to work. That will continue for a long time to come. Also, some companies simply do not want to allow employees to work from home unless they absolutely must. Those are corporate choices undoubtedly made for good reasons.   But cloud IT, led by service providers such as salesforce.com and others, is filling gaps, saving time and dollars, and offering a great deal of convenience for many companies.  Here is a list of some of Salesforce's top 10 hottest enterprise mobile apps of 2013. 1. Apttus Apttus’ quoting solution allows you to rapidly configure price and quote any product or service.  Apttus category-defining software drives the quote-to-cash process, increasing revenue and maximizing visibility and control. 2. DocuSign DocuSign is a fast, secure way to sign, send and store documents in the cloud. Whether you need to close a sales contract, buy a home or approve a project estimate, DocuSign's eSignature can handle it. You can sign at any time, any place on any Internet-enabled device. 3. Concur Concur is a leading global provider of integrated online and mobile business travel and expense management applications. 4. ServiceMax ServiceMax is field-service management software that the company positions as powerful, easy-to-use, efficient, mobile and collaborative. 5. Bracket Labs Bracket Labs was founded in 2010 to build applications distributed through the Salesforce.com AppExchange. The company's top apps are TaskRay, a shared to-do list and Campaign Calendar, which is a shared calendar for marketing campaigns. The company focuses its app designs on simplicity, agility and customer satisfaction. 6. Sylpheo Sylpheo enables sales people to make more calls. The Sylpheo apps are designed to enable faster, easier calling and contact management from any location. 7. Taptera Taptera transforms the unstoppable bring your own device, or BYOD, movement from an IT integration and security headache into a competitive advantage for businesses. These apps also represent transformational technology in fields such as CRM and conferences and events. 8. Xactly The core purpose of Xactly is to empower companies of all sizes to incent their employees correctly and scientifically. Xactly enables companies to design, implement, manage, audit and communicate sales compensation programs. ",
    "articleimage": "http://baburajannamalai.webs.com/Publisher/salescloud.png",
    "updatedtime": "2013-08-30 10:52:35",
	"authorname":"Parthiban"
  }
]